SET FOREIGN_KEY_CHECKS=0;
create database if not exists XMMarket;
use XMMarket;

create table if not exists t_mc_type
(
    cid       int auto_increment
        primary key,
    classname varchar(30) not null,
    parentid  int         null
)
    charset = utf8mb3;

create table if not exists t_mc
(
    id          int auto_increment
        primary key,
    name        varchar(30)    not null,
    description varchar(500)   null,
    price       decimal(16, 2) null,
    filename    varchar(300)   null,
    filepath    varchar(300)   null,
    isdel       int            null,
    maxid       int            null,
    minid       int            null,
    constraint fk1
        foreign key (minid) references t_mc_type (cid)
)
    charset = utf8mb3;

create table if not exists t_user
(
    uid      int auto_increment
        primary key,
    username varchar(30)  not null,
    password varchar(30)  not null,
    realname varchar(30)  not null,
    phone    varchar(30)  null,
    address  varchar(300) null,
    constraint username
        unique (username)
)
    charset = utf8mb3;

create table if not exists t_order
(
    orderid    int auto_increment
        primary key,
    ouser      varchar(30)    not null,
    odate      datetime       null,
    paytype    varchar(30)    not null,
    mctypesize int            null,
    mcsize     int            null,
    totalprice decimal(16, 2) null,
    msg        varchar(2000)  null,
    getname    varchar(30)    null,
    getaddress varchar(300)   null,
    getphone   varchar(30)    null,
    constraint fk3
        foreign key (ouser) references t_user (username)
)
    charset = utf8mb3;

create table  if not exists t_order_item
(
    nid             int auto_increment
        primary key,
    orderid         int            not null,
    itemid          int            not null,
    itemname        varchar(30)    not null,
    itemdescription varchar(300)   null,
    itemimg         varchar(100)   null,
    count           int            null,
    price           decimal(16, 2) null,
    totalprice      decimal(16, 2) null,
    constraint fk5
        foreign key (orderid) references t_order (orderid),
    constraint fk6
        foreign key (itemid) references t_mc (id)
)
    charset = utf8mb3;


-- ----------------------------
-- Records of t_mc
-- ----------------------------
INSERT INTO `t_mc` VALUES ('1', '小米9', '小米9是小米公司于2019年2月20日14点在北京工业大学体育馆发布的手机；内部代号是战斗天使。小米9采用圆润的曲面机身，全曲面机身与手掌贴合，颜色有深空灰、全息幻彩紫、全息幻彩蓝；边框厚度3.5毫米，最厚处7.61毫米，手机重173克。', '2499.00', 'temp.jpg', '小米9.jpg', '0',  '1', '25');
INSERT INTO `t_mc` VALUES ('2', '小米10', '小米10是小米公司旗下的手机，是一部“为了梦想打造的高端旗舰手机”，也是小米十年集大成之作，于2020年2月13日在国内正式发布，于2020年3月27日在海外正式发布。', '2999.00', 'temp.jpg', '小米10.jpg', '0', '1', '25');
INSERT INTO `t_mc` VALUES ('3', '小米10Pro', '小米10Pro是小米公司研发的一款手机，于2020年2月13日正式发布。小米10 Pro的正面采用AMOLED曲面原色屏，100%覆盖DCI-P3和sRGB色域，高度162.6毫米，宽度74.8毫米，厚度8.96毫米，重量208克，提供“珍珠白”、“星空蓝”双色可选。', '3999.00', 'temp.jpg', '小米10Pro.jpg', '0',  '1', '25');
INSERT INTO `t_mc` VALUES ('4', '三星 S20', '三星Galaxy S20是三星在2020年2月12日发布的一款智能手机。Galaxy S20提供遐想灰、浮氧蓝、柔雾粉三种配色。2020年2月12日凌晨正式发布。', '6999.00', 'temp.jpg', '三星S20.jpg', '0', '1', '20');
INSERT INTO `t_mc` VALUES ('5', '三星Galaxy S20+', '三星Galaxy S20+采用了6.7英寸Dynamic AMOLED Infinity-O屏幕，支持120Hz刷新率与HDR10+。', '7999.00', '中文temp.jpg', '三星Galaxy S20+.jpg', '0', '1', '20');
INSERT INTO `t_mc` VALUES ('6', '小米柔风空调', '小米柔风立式空调是小米商城上架的一款新产品。除了常见的空调功能外，它支持柔风模式、全直流变频设计，拥有新一级能效认证，并且可以接入米家APP，支持小爱同学远程语音智能操控。', '2399.00', 'temp.jpg', '小米柔风空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('7', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('8', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('9', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('10', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('11', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('12', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('13', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('14', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('15', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('16', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('17', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('18', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('19', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('20', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('21', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('22', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('23', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('24', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('25', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('26', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('27', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('28', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('29', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('30', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('31', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('32', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('33', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '1',  '22', '26');
INSERT INTO `t_mc` VALUES ('34', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '1',  '22', '26');
INSERT INTO `t_mc` VALUES ('35', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '1',  '22', '26');
INSERT INTO `t_mc` VALUES ('36', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('37', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '1',  '22', '26');
INSERT INTO `t_mc` VALUES ('38', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('39', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '1',  '22', '26');
INSERT INTO `t_mc` VALUES ('40', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('41', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '1',  '22', '26');
INSERT INTO `t_mc` VALUES ('42', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '0',  '22', '26');
INSERT INTO `t_mc` VALUES ('43', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', 'temp.jpg', '米家互联网空调.jpg', '1',  '22', '26');
INSERT INTO `t_mc` VALUES ('46', '联想拯救者 R720', '联想笔记本', '4999.00', 'temp.jpg', '20200722202158826_联想拯救者R720.jpg', '1', '2', '7');
INSERT INTO `t_mc` VALUES ('47', '联想拯救者 R720', '联想笔记本', '4999.00', 'temp.jpg', '20200722202721424_联想拯救者R720.jpg', '0', '2', '7');
INSERT INTO `t_mc` VALUES ('48', '联想拯救者 R720', '联想笔记本', '4999.00', 'temp.jpg', '20200722202721424_联想拯救者R720.jpg', '0', '2', '7');
INSERT INTO `t_mc` VALUES ('49', '小米9', '小米9', '2999.00', '', '202007231128385_小米9.jpg', '1',  '1', '25');
INSERT INTO `t_mc` VALUES ('50', '米家互联网空调', '米家互联网空调是小米米家发布的一款空调，具有高效制冷/热的功能，同时噪音最低为22分贝，还有强大的变频技术，防霉抑菌滤网以及悬浮式设计。小米为米家互联网空调提供6年的质保。', '2099.00', '', '米家互联网空调.jpg', '1',  '22', '26');
INSERT INTO `t_mc` VALUES ('51', '小米9', '', '2999.00', '联想拯救者R720.jpg', '20200828202810702_联想拯救者R720.jpg', '1', '1', '25');


-- ----------------------------
-- Records of t_mc_type
-- ----------------------------
INSERT INTO `t_mc_type` VALUES ('1', '手机', '0');
INSERT INTO `t_mc_type` VALUES ('2', '笔记本', '0');
INSERT INTO `t_mc_type` VALUES ('7', 'Lenovo', '2');
INSERT INTO `t_mc_type` VALUES ('8', '华硕', '2');
INSERT INTO `t_mc_type` VALUES ('19', 'Redmi', '1');
INSERT INTO `t_mc_type` VALUES ('20', '三星', '1');
INSERT INTO `t_mc_type` VALUES ('21', '荣耀', '1');
INSERT INTO `t_mc_type` VALUES ('22', '空调', '0');
INSERT INTO `t_mc_type` VALUES ('23', '美的', '22');
INSERT INTO `t_mc_type` VALUES ('24', '格力', '22');
INSERT INTO `t_mc_type` VALUES ('25', '小米', '1');
INSERT INTO `t_mc_type` VALUES ('26', '米家', '22');
INSERT INTO `t_mc_type` VALUES ('27', '奥克斯', '22');
INSERT INTO `t_mc_type` VALUES ('28', '微星', '1');

